# FamilySizeTable Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTable Class
Members See Also
---
Contains size information for a family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class FamilySizeTable : IDisposable
```

Visual Basic
---
```text
Public Class FamilySizeTable _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FamilySizeTable : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FamilySizeTable
# See Also
FamilySizeTable Members
Autodesk.Revit.DB Namespace